# Normalization

What is database normalization?
- Ref: https://www.complexsql.com/database-normalization/
- Ref: http://www.databasedev.co.uk/1norm_form.html
- The purpose of database normalization is to:
- eliminate redundant data
- reduce complexity of data, making it easier to manage the data and make change
- ensure logical data dependencies
- How is database normalization achieved?
  - By fulfilling five normal forms. Each normal form represents an increasingly stringent set of rules. Usually fulfilling the first three normal forms is sufficient.
  - Ref: https://www.1keydata.com/database-normalization/first-normal-form-1nf.php
- First Normal Form  (1NF): 
  1. if there are no repeating groups.
  2. all values are atomic, meaning they are the smallest meaningful value
- Second Normal Form  (2NF): 
  1. the table is in first normal form
  2. each non-key field is functionally dependent on the entire primary key
- Third Normal Form (3NF):
  1. the table is in second normal form
  2. there are no transitive dependencies
- Ref: https://arctype.com/blog/2nf-3nf-normalization-example/
- Summary
  1. All values must be atomic
  2. No redundancy
  3. No implicit relationship/dependency
  4. No transitive relationship/dependency

## Bad Design Examples
### Example 1

In [1]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('example1.db')

sql_statement = "SELECT * FROM EMPLOYEES_PROJECTS_TIME"
df = pd.read_sql_query(sql_statement, conn)
df.style.set_table_attributes('style="font-size: 12px"')

- Problems with example1
  - Repeating group of fields
  - The project and time fields are not made up of atomic values
  - Can't sort by last name
  - Can't sort by time because field is type text
  - Assumed relationship between project and time

### Example 2

In [2]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('example2.db')

sql_statement = "SELECT * FROM EMPLOYEES_PROJECTS_TIME"
df = pd.read_sql_query(sql_statement, conn)
df.style.set_table_attributes('style="font-size: 12px"')

- Analysis of example2
  - Can sort now!
  - How can you add another project?

### Example 3

In [3]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('example3.db')

sql_statement = "SELECT * FROM EMPLOYEES"
df = pd.read_sql_query(sql_statement, conn)
df.style.set_table_attributes('style="font-size: 12px"')
display(df)

sql_statement = "SELECT * FROM PROJECTS_EMPLOYEES_TIME"
df = pd.read_sql_query(sql_statement, conn)
df.style.set_table_attributes('style="font-size: 12px"')

  EmployeeID Last_Name First_Name
0     EN1-26   O'Brien       Sean
1     EN1-33      Guya        Amy
2     EN1-35   Baranco     Steven
3     EN1-36    Roslyn  Elizabeth
4     EN1-38    Schaaf      Carol
5     EN1-40      Wing  Alexandra

- Analysis of example3 -- first normal form
  - Can do groups by employeeid or projectnum
  - Can sort by time
  - Can sort by name


### Example 4

In [4]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('example4.db')

sql_statement = "SELECT * FROM EMPLOYEES_PROJECTS"
df = pd.read_sql_query(sql_statement, conn)
df.style.set_table_attributes('style="font-size: 12px"')

- Analysis of example4
  - How would you update the project title for a given project? Have to edit in many places
  - Can you add a project without an employeeid?
  - How can you delete a project?

### Example 5

In [5]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('example5.db')

sql_statement = "SELECT * FROM EMPLOYEES"
df = pd.read_sql_query(sql_statement, conn)
df.style.set_table_attributes('style="font-size: 12px"')
display(df)

sql_statement = "SELECT * FROM EMPLOYEES_PROJECTS"
df = pd.read_sql_query(sql_statement, conn)
df.style.set_table_attributes('style="font-size: 12px"')
display(df)

sql_statement = "SELECT * FROM PROJECTS"
df = pd.read_sql_query(sql_statement, conn)
df.style.set_table_attributes('style="font-size: 12px"')

  EmployeeID Last_Name First_Name
0     EN1-26   O'Brien       Sean
1     EN1-33      Guya        Amy
2     EN1-35   Baranco     Steven
3     EN1-36    Roslyn  Elizabeth
4     EN1-38    Schaaf      Carol
5     EN1-40      Wing  Alexandra

   EmployeeID  ProjectNum
0      EN1-26   30-452-T3
1      EN1-26   30-457-T3
2      EN1-26   31-124-T3
3      EN1-33   30-328-TC
4      EN1-33   30-452-T3
5      EN1-33   32-244-T3
6      EN1-35   30-452-T3
7      EN1-35   31-238-TC
8      EN1-36   35-152-TC
9      EN1-38   36-272-TC
10     EN1-40  31-238-TC2
11     EN1-40   31-241-TC

- Analysis of example5
  - second normal form

### Example 6

In [6]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('example6.db')
sql_statement = "SELECT * FROM PROJECTS"
df = pd.read_sql_query(sql_statement, conn)
df.style.set_table_attributes('style="font-size: 12px"')

- Analysis of example 6
  - Phone number, which is a non-key field, has transitive dependency on another non-key field. 

### Example 6

In [7]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('example7.db')
sql_statement = "SELECT * FROM MANAGERS"
df = pd.read_sql_query(sql_statement, conn)
df.style.set_table_attributes('style="font-size: 12px"')
display(df)

conn = sqlite3.connect('example7.db')
sql_statement = "SELECT * FROM PROJECTS"
df = pd.read_sql_query(sql_statement, conn)
df.style.set_table_attributes('style="font-size: 12px"')

  ProjectMgr  Phone
0   Friedman   2846
1   Garrison   2756
2    Jacanda   2954
3      Jones   3102
4      Vance   3022

- Analysis of example7
  - Removed transitive dependency